Reports/ИА_ВедомостьЗНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ИА_ВедомостьЗНО</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ИА_ЗаказыНаПриобретение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_ЗаказыНаПриобретение</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ИА_ЗаявкаНаОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_ЗаявкаНаОбязательства</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИА_ИсторияСтатусовЗВС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ситуация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СостояниеЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСУ_СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Записан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ИА_ВедомостьЗНО/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаПанельНастроек.Пометка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)
    Эл = Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаПанельНастроек;
    Эл.Пометка = Не Эл.Пометка;
    Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Эл.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Попытка 
		ТекстОбласти = Элемент.ТекущаяОбласть.Текст;
		ДокСсылка = ПолучитьДокументПоТексту(ТекстОбласти);
		Если ДокСсылка = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Исключение
		Возврат;
	КонецПопытки;
	ВывестиРасшифровкуЗНО(ДокСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРасшифровкуЗНО(ДокСсылка)
	ТабДокРасшифровка = СуммаОткрытиеНаСервере(ДокСсылка);
	ТабДокРасшифровка.ОтображатьСетку = Ложь;
	ТабДокРасшифровка.ОтображатьЗаголовки = Ложь;
	ТабДокРасшифровка.ТолькоПросмотр = Истина;
	ТабДокРасшифровка.Показать();
КонецПроцедуры

&НаСервере
Функция СуммаОткрытиеНаСервере(ДокСсылка)
	
	РезСтроки = ВернутьДеталировкуПоДокументу(ДокСсылка);
	
	ТабДокРасшифровка = Новый ТабличныйДокумент;
	
	Макет = Отчеты.ИА_ВедомостьЗНО.ПолучитьМакет("МакетРасшифровки"); 
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ОбластьШапка.Параметры.Заголовок = "Расшифровка по документу " + ДокСсылка;
	ТабДокРасшифровка.Вывести(ОбластьШапка);
	Сч = 0;
	ТекСумма = 0;
	Для Каждого ТекСтрока Из РезСтроки Цикл
		Сч = Сч + 1;
		Если Сч = 1 Тогда
			ТекСумма = ТекСтрока.НачальныйОстаток;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрока.Документ) Тогда 
			ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
			ОбластьСтрока.Параметры.НачальныйОстаток = ТекСумма;
			ОбластьСтрока.Параметры.Приход = ТекСтрока.Приход;
			ОбластьСтрока.Параметры.Расход = ТекСтрока.Расход;
			ТекСумма = ТекСумма + ТекСтрока.Приход - ТекСтрока.Расход;
			ОбластьСтрока.Параметры.КонечныйОстаток = ТекСумма;
			ОбластьСтрока.Область(1,1,1,1).Расшифровка = ТекСтрока.Документ;
			ТабДокРасшифровка.Вывести(ОбластьСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабДокРасшифровка;
КонецФункции

Функция ПолучитьДокументПоТексту(ТекстОбласти);
	//ТекстОбласти = "Заявка на обязательства 000000001 от 17.12.2015 16:12:09";
	Если Найти(ТекстОбласти,"Заявка на обязательства ") = 0 Тогда 
		Возврат Неопределено;
	Иначе
		Номер = Сред(ТекстОбласти,25,9);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_ЗаявкаНаОбязательства.Ссылка
	|ИЗ
	|	Документ.ИА_ЗаявкаНаОбязательства КАК ИА_ЗаявкаНаОбязательства
	|ГДЕ
	|	ИА_ЗаявкаНаОбязательства.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", Номер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВернутьДеталировкуПоДокументу(ДокСсылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_ЗаказыНаПриобретение.ЗП.Основание КАК ЗаявкаНаОбязательства,
	|	-ИА_ЗаказыНаПриобретение.Сумма КАК СуммаНачальныйОстаток,
	|	0 КАК СуммаПриход,
	|	0 КАК СуммаРасход,
	|	NULL КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Движения
	|ИЗ
	|	РегистрНакопления.ИА_ЗаказыНаПриобретение КАК ИА_ЗаказыНаПриобретение
	|ГДЕ
	|	ИА_ЗаказыНаПриобретение.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ИА_ЗаказыНаПриобретение.Период < &НачалоПериода
	|	И ИА_ЗаказыНаПриобретение.ЗП.Основание <> ЗНАЧЕНИЕ(Документ.ИА_ЗаявкаНаОбязательства.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИА_ЗаявкаНаОбязательства.Ссылка,
	|	ИА_ЗаявкаНаОбязательства.Сумма,
	|	0,
	|	0,
	|	NULL
	|ИЗ
	|	Документ.ИА_ЗаявкаНаОбязательства КАК ИА_ЗаявкаНаОбязательства
	|ГДЕ
	|	ИА_ЗаявкаНаОбязательства.Проведен
	|	И ИА_ЗаявкаНаОбязательства.Дата < &НачалоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИА_ЗаявкаНаОбязательства.Ссылка,
	|	0,
	|	ИА_ЗаявкаНаОбязательства.Сумма,
	|	0,
	|	ИА_ЗаявкаНаОбязательства.Ссылка
	|ИЗ
	|	Документ.ИА_ЗаявкаНаОбязательства КАК ИА_ЗаявкаНаОбязательства
	|ГДЕ
	|	ИА_ЗаявкаНаОбязательства.Проведен
	|	И ИА_ЗаявкаНаОбязательства.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИА_ЗаказыНаПриобретение.ЗП.Основание,
	|	0,
	|	0,
	|	ИА_ЗаказыНаПриобретение.Сумма,
	|	ИА_ЗаказыНаПриобретение.Регистратор
	|ИЗ
	|	РегистрНакопления.ИА_ЗаказыНаПриобретение КАК ИА_ЗаказыНаПриобретение
	|ГДЕ
	|	ИА_ЗаказыНаПриобретение.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ИА_ЗаказыНаПриобретение.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ИА_ЗаказыНаПриобретение.ЗП.Основание <> ЗНАЧЕНИЕ(Документ.ИА_ЗаявкаНаОбязательства.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Движения.ЗаявкаНаОбязательства,
	|	СУММА(ВТ_Движения.СуммаНачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(ВТ_Движения.СуммаПриход) КАК Приход,
	|	СУММА(ВТ_Движения.СуммаРасход) КАК Расход,
	|	ВТ_Движения.Регистратор КАК Документ,
	|	ВТ_Движения.Регистратор.МоментВремени КАК РегистраторМоментВремени
	|ИЗ
	|	ВТ_Движения КАК ВТ_Движения
	|ГДЕ
	|	ВТ_Движения.ЗаявкаНаОбязательства = &ДокСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Движения.ЗаявкаНаОбязательства,
	|	ВТ_Движения.Регистратор,
	|	ВТ_Движения.Регистратор.МоментВремени
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегистраторМоментВремени
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	КоллекцияПП = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	П_Период = Неопределено;
	Для Каждого Стр Из КоллекцияПП Цикл
		Попытка
			Если "" + Стр.Параметр = "ПериодОтчета" Тогда 
				П_Период = Стр.Значение;
				Прервать;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Если П_Период = Неопределено Тогда 
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", П_Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", П_Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
    Элементы.ВариантОтчета.Заголовок = "Вариант отчета: " + ПредставлениеТекущегоВарианта;
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
    Эл = Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы.ФормаПанельНастроек;
    Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Эл.Пометка;
КонецПроцедуры
